[
  {
    "id": 1,
    "name": "Calceare",
    "url": "https://calceare.charlesmangin.fr",
    "image": "https://collabyu.thomasjeu.fr/img/image2.jpg",
    "type": "Website",
    "date": "2022",
    "desc": "Calceare was a project mainly focused on the usage of Symfony, a PHP framework. As part of a group of 5 people, my job was to organize the backend aspects of the application, namely the routing aspects as well as the interfacing between the web client and the server.",
    "techno": [
      {
        "id": 1,
        "name": "PHP"
      },
      {
        "id": 2,
        "name": "Symfony"
      },
      {
        "id": 3,
        "name": "MySQL"
      }
    ]
  },
  {
    "id": 2,
    "name": "The_Game_Library",
    "url": "",
    "image": "https://butmmi.thomasjeu.fr/wp-content/uploads/2021/12/image1.jpg",
    "type": "Mobile App",
    "date": "2022",
    "desc": "The Game Library is an IMDB-like app that runs on your phone by downloading a .apk. Using multiple APIs to reach for data, this apps lets you see the current landscape of video gaming. The key features are: a searching loop of games, developers, editors, and themes ; the possibility of saving your favourite games ; a weekly ranking of the best-rated games ; the ability to rate games and discovery the community rankings.",
    "techno": [
      {
        "id": 1,
        "name": "Ionic"
      },
      {
        "id": 2,
        "name": "APIs"
      }
    ]
  },
  {
    "id": 3,
    "name": "ArchiTech",
    "url": "https://architech.charlesmangin.fr",
    "image": "https://architech.charlesmangin.fr/static/img/desktop-artiste1.31c7ecd.png",
    "type": "Website",
    "date": "2022",
    "desc": "Life is art, and art is life. Let's discover together Jean-Pierre Ugarte, a french painter know for his brutalist architectural art pieces. Why chose this subject for a website you might ask? Well, as far as I'm concerned: both in technology and Jean-Pierre Ugarte's works, structure is everything. Is this why I like his art so much? Who know :)",
    "techno": [
      {
        "id": 1,
        "name": "Vue.js"
      },
      {
        "id": 2,
        "name": "Node.js"
      },
      {
        "id": 3,
        "name": "HTML/CSS"
      }
    ]
  },
  {
    "id": 4,
    "name": "MeMO",
    "url": "https://projetmemo.ngelin25.fr",
    "image": "https://projetmemo.nikolag25.fr/static/img/Memo_1.7442942.jpg",
    "type": "Website",
    "date": "2022",
    "desc": "MeMO, a website made for a student association in Montbéliard, France. This website was created using Vue.JS and a headless CMS. My role was to be the project manager as well as a developer in a team made up of several students.",
    "techno": [
      {
        "id": 1,
        "name": "Vue.js"
      },
      {
        "id": 2,
        "name": "CMS Headless (WordPress)"
      },
      {
        "id": 3,
        "name": "HTML/CSS"
      }
    ]
  },
  {
    "id": 5,
    "name": "AterinGames",
    "url": "https://alteringames.charlesmangin.fr",
    "image": "https://alteringames.charlesmangin.fr/img/board-game.png",
    "type": "Website",
    "date": "2021",
    "desc": "AlterinGames was an app made entirely in PHP. The aim of this app was to create a community around the topic of board games. Being the leader of a group of 3 people, my role was to organize the tasks (while working in a AGILE environment), manage the code reviews, and that into account the economic aspects of the project.",
    "techno": [
      {
        "id": 1,
        "name": "PHP (OOP)"
      },
      {
        "id": 2,
        "name": "MySQL"
      },
      {
        "id": 3,
        "name": "HTML/CSS"
      }
    ]
  },
  {
    "id": 6,
    "name": "AI-a_not_so_bright_future",
    "url": "https://projets1.charlesmangin.fr",
    "image": "https://projets1.charlesmangin.fr/img/theodore-cityview.jpeg",
    "type": "Website",
    "date": "2020",
    "desc": "AI is a fascinating subject which was always very alluring to me. When tasked with making my first website as part of my junior year as a multimedia university student, this is the subject I choose. While not very impressive technically, the content of this website still remains to this day a glass window through which you might catch a glimpse of the future that could await us all.",
    "techno": [
      {
        "id": 1,
        "name": "HTML/CSS"
      }
    ]
  },
  {
    "id": 7,
    "name": "Lego_Three.js",
    "url": "",
    "image": "https://benoitpiranda.fr/assets/lego/rendu6.png",
    "type": "3D",
    "date": "2022",
    "desc": "While studying under Benoit Piranda, multiple projects were given to us around the thematic of web 3D. One of them was to make a small lego game using Three.js and models we made ourselves inside 3DSMAX. While I'm by no means a 3D artist, this project was still interesting for me and made my discover an aspect of the web which I didn't know a lot about.",
    "techno": [
      {
        "id": 1,
        "name": "WebGL"
      },
      {
        "id": 2,
        "name": "3DSMAX"
      }
    ]
  },
  {
    "id": 8,
    "name": "e-VATplus",
    "url": "",
    "image": "https://e-vatplus.com/wp-content/uploads/2022/12/vision.jpg",
    "type": "Website",
    "date": "2022",
    "desc": "While being part of Solead Agency as a web developer, I had the chance of witnessing many different typologies of web apps. From the simple SPA, to more complex content management systems, or even full e-commerce websites, my stay at Solead Agency drastically improved both my capabilities as a web developer, and my knowledge as a web user. E-VATplus was one of the first websites I made from A to Z while working at Solead Agency.",
    "techno": [
      {
        "id": 1,
        "name": "PHP"
      },
      {
        "id": 2,
        "name": "CMS (WordPress)"
      },
      {
        "id": 3,
        "name": "HTML/CSS"
      }
    ]
  },
  {
    "id": 9,
    "name": "Annabel_Roussel_Hypnose",
    "url": "",
    "image": "https://hypnose.charlesmangin.fr/wp-content/uploads/2023/01/pexels-shvets-production-7176319.jpg",
    "type": "Website",
    "date": "2023",
    "desc": "As part of a more broader decision of establishing myself as a freelance web developer, I had the change to work for different clients by myself. One of the first websites I made as a freelance is Annabel Roussel Hypnose.",
    "techno": [
      {
        "id": 1,
        "name": "PHP"
      },
      {
        "id": 2,
        "name": "CMS (WordPress)"
      },
      {
        "id": 3,
        "name": "HTML/CSS"
      }
    ]
  }
]